import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

x1 = np.array([100,
               100,
               100,
               100,
               100,
               1000,
               1000,
               1000,
               1000,
               1000,
               10000,
               10000,
               10000,
               10000,
               10000,
               50000,
               50000,
               50000,
               50000,
               50000,
               80000,
               80000,
               80000,
               80000,
               80000,
               100000,
               100000,
               100000,
               100000,
               100000])
y1 = np.array([7626648/100000000,
               7599899/100000000,
               7578982/100000000,
               7576185/100000000,
               7568950/100000000,
               4432926/10000000,
               4412898/10000000,
               4389564/10000000,
               4420851/10000000,
               4428807/10000000,
               4187755/1000000,
               4156110/1000000,
               4188677/1000000,
               4192028/1000000,
               4197074/1000000,
               21078201/1000000,
               20923274/1000000,
               21085721/1000000,
               21231555/1000000,
               21036510/1000000,
               3717936/100000,
               3801249/100000,
               3735473/100000,
               3723827/100000,
               3737987/100000,
               4649644/100000,
               4672260/100000,
               4637052/100000,
               4649852/100000,
               4670596/100000])

x2 = np.array([100,
               100,
               100,
               100,
               100,
               1000,
               1000,
               1000,
               1000,
               1000,
               10000,
               10000,
               10000,
               10000,
               10000,
               40000,
               40000,
               40000,
               40000,
               40000,
               70000,
               70000,
               70000,
               70000,
               70000,
               100000,
               100000,
               100000,
               100000,
               100000])
y2 = np.array([/100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000,
               /100000000])

coefficients1 = np.polyfit(x1, y1, 1)
polynomial1 = np.poly1d(coefficients1)

coefficients2 = np.polyfit(x2, y2, 10)
polynomial2 = np.poly1d(coefficients2)

plt.figure(figsize=[15, 5])
plt.suptitle("Зависимость времени поиска пары от количества элементов в массиве, равномерности их распределения и стратегии поиска", fontweight='bold')
plt.subplots_adjust(wspace= 0.4)

plt.subplot(121)
plt.scatter(x1, y1)
plt.plot(x1, polynomial1(x1), color='red')
plt.grid()
plt.title("Стратегия А: равномерное распределение", fontsize=10)

plt.subplot(122)
plt.scatter(x2, y2)
plt.plot(x2, polynomial2(x2), color='blue')
plt.grid()
plt.title("Стратегия А: неравномерное распределение", fontsize=10)

plt.show()